{
  "1.4.7": [
      "Деталювання повернуто до попередньої версії",
      "В властивості фурнітури додана кнопка видалити/додати мітку. Підійде для користуваців Fredo Sсale які люблять зменшувати довгі профілі по довжині більше ніж в 2 рази ",
      "І специфікацію додана кнопка розумний фільтр де можна відфільтрувати одразу декілька постачальників, а не лише одного як в стандартному фільтрі"      
    ],
  "1.4.6": [
      "Додано розрахунок ваги в специфікації",
      "Додана крайка в деталювання"
     
      
    ],
  "1.4.5": [
      "Виправлено коли назначав префікс модулю при пустому полі для вводу",
      "При переносі кріплення якщо у отворів немає словника ABF - тепер не виникає критична помилка",
      "Збільшена швидкість модуля по переносу кріплення"
      
    ],
  "1.4.4": [
      "Виправлено проблему коли шрифти в таблицях не змінювалися",
      "Надати властивості фурнітурі тепер в html діалозі і ширше, додана кнопка видалити (видаляє атрибути з виділеної групи)",
      "В деталюванні коли увімкнутий чекбокс розбивати по матеріалах виводить біля матеріалу суммарну площу його в моделі або в виділеній групі",
      "Перероблений префікс"
    ],
  "1.4.3": [
      "В налаштуваннях додана зміна шрифта для всіх html диалогів плагіна",
      "В деталюванні додано розбивка по матеріалах чи тегах (можна обрати лише один чекбокс",
      "В специфікацію додана вкладка з погонними матеріалами, з можливістью збереження списку в CSV"
    ],
  "1.4.2": [
      "Виправлена вспливаюча підказка на кнопці Деталювання",
      "Деталювання не округлює розміри, але деталі нестандартно повернуті до осей поки що показує невірно",
      "В деталювання додана можливість замість номеру по порядку відображати № деталі АБФ та прибираті з назви номери АБФ, покращене сортування, можливо сортувати за назвою деталі не враховуючи номер деталі на початку назви",
      "Таблицю з деталювання коректно зберігає в CSV, зберігаючи сортування по стовпцям користувача",
      "В деталюванні при фільтрації по матеріалу тепер також може відображати деталі тільки для виділених модулів, або для всієї моделі якщо немає виділення (а не для усієї моделі раніше)",
      "В налаштуваннях додано можливість обирати отвори які ігнорувати в специфікації. Доступні отвори відображаються в випадаючому списку, ви можете обрати та додати кнопкою потрібний (або видалити)",
      "Відтепер щоб стандартні отвори, та отвори з інших плагінів потрапляли в специфікацію-не треба спочатку переносити кріплення, все показує відразу коли викликаєте специфікацію",
      "В Експорті фурнітури на віяр к-во змінено на К-сть"
    ],  
  "1.4.1": [
      "Додано вікно з інформацією про зміни в новій версії.",
      "В зміні отворів додана зміна назв отворів.",
      "Динамічні атрибути фурнітури перенесено в словник, це не вплине на вже створену фурнітуру.",
      "Специфікація працює як з динамічними атрибутами так і зі словником.",
      "Додані налаштування,групувати фурнітуру в групу • Фурнітура чи ні",
      "Додано деталювання"
    ],
    "1.4.0": [
      "Тепер преносить отвори з середини груп фурнітури ",
      "Поправив глюк коли не ставило мітку (не блокувало групу від ABF) всередині групи з фурнітурою",
      "Не обрізає назву вкладених груп по пробілу"
    ]
  }